tap 'homebrew/bundle'
tap 'homebrew/core'
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "heroku/brew"

# Productivity tools

cask 'alfred'
cask 'google-japanese-ime'
cask 'clipy'
cask 'gyazo'

# Office tools
cask 'microsoft-office'
mas 'Cybozu Desktop', id: 905155357

# Mail client
mas 'Kiwi for Gmail', id: 986304488
cask 'thunderbird'
brew 'neomutt'

## Remote client tools
cask 'teamviewer'
cask 'parallels-client'
cask 'vnc-viewer'

## Communication tools

cask 'slack'
cask 'chatwork'
cask 'zoom'
cask 'discord'
mas 'LINE', id: 539883307

# Web browseres

cask 'google-chrome'
cask 'brave-browser'
cask 'vivaldi'
cask 'firefox'
cask 'waterfox-current'
cask 'iridium'
cask 'coccoc'
cask 'microsoft-edge'
cask 'brave-browser'
cask 'opera'
cask 'sleipnir'
cask 'chromium'
cask 'github'

# Developer tools

mas 'Xcode', id: 497799835

## iOS App develop tools
brew 'cocoapods'

## Android App develop tools
cask 'android-sdk'

## CLI tools

cask 'iterm2'
# alacritty instead of hyper3
cask 'hyper'
#cask 'alacritty'
brew 'git'
brew 'git-lfs'
brew 'gh'
brew 'anyenv'
brew 'tmux-xpanes'

cask 'google-cloud-sdk'
brew 'awscli'
brew "heroku/brew/heroku"
brew 'direnv'

# for require dbeaver&android
cask 'adoptopenjdk8'

cask 'sourcetree'
cask 'beyond-compare'

# Edidor tools

cask 'sublime-text'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
cask 'typora'
cask 'xmind'

## Database client tools
cask 'dbeaver-community'
cask 'sequel-ace'
brew 'libpq'

## Virtual Machine tools

cask 'virtualbox'
cask 'vagrant'

cask 'docker'
# brew 'docker-compose'

## Develop Library tools
brew 'zlib'
brew 'autoconf'
brew 'bzip2'
# brew 'icu4c'
# brew 'krb5'
# brew 'libedit'
# brew 'libiconv'
# changed libjpeg to jpeg
# brew 'jpeg'
# brew 'libpng'
# brew 'libxml2'
# brew 'libzip'
# brew 'oniguruma'
brew 'openssl@1.1'
# brew 'tidy-html5'
brew "nkf"
brew "fswatch"
brew "htop"
brew "pstree"
brew "tree"
brew "gh"
brew 'curl'
brew 'libffi'
brew 'watchman'

### bash history incremental search
brew "peco"

## Network tools
brew "wget"
brew "nmap"
brew "inetutils"

# Authoring tools

#cask 'gimp'
#cask 'handbrake'
#cask 'vlc'

# Credential management tools
brew "lastpass-cli"
mas "LastPass", id: 926036361

# Book viewer
cask "kindle"
cask "yacreader"

# etc tools
mas "The Unarchiver", id: 425424353
brew 'wakeonlan'

# English translation
cask "deepl"

# Cloud Storage
cask "osxfuse"

# Authentication tools
cask 'authy'
