tap 'homebrew/bundle'
tap 'homebrew/core'
tap "homebrew/cask"
tap "heroku/brew"

# Productivity tools

cask 'alfred'
cask 'google-japanese-ime'
cask 'clipy'
cask 'microsoft-office'
mas 'Kiwi for Gmail', id: 986304488
mas 'Cybozu Desktop', id: 905155357
#cask 'gyazo'

## Remote client tools
cask 'teamviewer'
cask 'parallels-client'
cask 'vnc-viewer'

## Communication tools

cask 'slack'
cask 'chatwork'
cask 'zoomus'
mas 'LINE', id: 539883307

# Web browseres

cask 'google-chrome'
cask 'brave-browser'
cask 'vivaldi'
cask 'firefox'
cask 'waterfox'
cask 'iridium'
cask 'coccoc'
cask 'microsoft-edge'
cask 'brave'
cask 'opera'
cask 'sleipnir'
cask 'github'

# Developer tools

mas 'Xcode', id: 497799835

## CLI tools

cask 'iterm2'
brew 'anyenv'
brew 'tmux-xpanes'

cask 'google-cloud-sdk'
cask 'awscli'
brew "heroku/brew/heroku"

# Edidor tools

cask 'sublime-text'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
mas 'Kobito', id: 896624060


## Database tools

cask 'dbeaver-community'
cask 'sequel-pro'

## Virtual Machine tools

cask 'virtualbox'
cask 'vagrant'

cask 'docker'
brew 'docker-compose'

## Develop Library tools

# brew 'zlib'
# brew 'autoconf'
# brew 'bzip2'
# brew 'icu4c'
# brew 'krb5'
# brew 'libedit'
# brew 'libiconv'
# changed libjpeg to jpeg
# brew 'jpeg'
# brew 'libpng'
# brew 'libxml2'
# brew 'libzip'
# brew 'oniguruma'
# brew 'openssl@1.1'
# brew 'pkg-config'
# brew 'tidy-html5'

# Authoring tools

#cask 'gimp'
#cask 'handbrake'
#cask 'vlc'
